app/controllers/my_threads_controller.rb

SELECT "my_threads".* FROM "my_threads"
---
  def index
    @my_threads = MyThread.all

INSERT INTO "my_threads" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", ""], ["created_at", "2022-09-03 04:45:26.207493"], ["updated_at", "2022-09-03 04:45:26.207493"]]
---
  def create
    @my_thread = MyThread.new(my_thread_params)

    respond_to do |format|
      if @my_thread.save

UPDATE "my_threads" SET "title" = ?, "updated_at" = ? WHERE "my_threads"."id" = ?  [["title", ""], ["updated_at", "2022-09-08 11:00:23.325470"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @my_thread.update(my_thread_params)

DELETE FROM "my_threads" WHERE "my_threads"."id" = ?  [["id", 1]]
---
  def destroy
    @my_thread.destroy

SELECT "my_threads".* FROM "my_threads" WHERE "my_threads"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_my_thread
      @my_thread = MyThread.find(params[:id])